#include <cfloat>
#include "./includes.h"
#include "Hookign/ret_spoofing.h"
#include "canvas_gui.h" 
#include <unordered_set>
#pragma comment(lib, "Winmm.lib")
// Somewhere global
skin_data_asset* G_LastEquippedSkinData = nullptr;
enum class EAresEquippableState : uint8_t {
    Unknown = 0,
    Idle = 1,
    Equipping = 2,
    Inspecting = 3,
    Attacking = 4,
    Firing = 5,
    Reloading = 6,
    ADS_Idle = 7,
    ADS_Firing = 8,
    Count = 9,
    EAresEquippableState_MAX = 10
};
struct FProjectileThrowTuning {
   
    float SpeedScale; // 0x20(0x04)
    float UpwardArc; // 0x24(0x04)
    float UpwardShift; // 0x28(0x04)
    char pad_2C[0x4]; // 0x2c(0x04)
    struct FVector ThrowOffset; // 0x30(0x18)
    float ThrowDelay; // 0x48(0x04)
    bool bJumpThrowNormalization_LaunchPoint; // 0x4c(0x01)
    bool bJumpThrowNormalization_ImpartedVelocity; // 0x4d(0x01)
    char pad_4E[0x2]; // 0x4e(0x02)
};
//void ReadGrenadeThrowInfo() {
//    if (!MyShooter) return;
//
//    auto inventory = MyShooter->GetInventory();
//    if (!inventory) return;
//
//    auto weapon = inventory->GetCurrentWeapon();
//    if (!weapon) return;
//
//    AGameObject* Ability = nullptr;
//    static AGameObject* CachedAbility = nullptr;
//
//    // ✅ Use cached Ability object if valid and name matches
//    if (CachedAbility && Memory::IsValidPointer((uintptr_t)CachedAbility)) {
//        auto name = kismentsystemlibrary::get_object_name((UObject*)CachedAbility);
//        if (name.IsValid() && name.ToString() == "Ability_Sarge_Q_Molotov_Production_C") {
//            Ability = CachedAbility;
//        }
//    }
//
//    // ✅ Otherwise, find the ability dynamically
//    if (!Ability) {
//        TArray<AGameObject*> Objects;
//        GameplayStatics::GetAllActorsOfClass(UWorldSave, Class::ShooterGameObject());
//
//        for (auto* Object : Objects) {
